# 2. Створіть програму, яка перевіряє, чи є паліндромом введена фраза.

def palindrom(stirng):
    i = 0
    j = int(len(string.replace(' ', '')))

    while True:
        if string.replace(' ', '')[i] == string.replace(' ', '')[j-1]:
            i += 1
            j -= 1
            if i == j - 1 or i > j - 1:
                print("Введена фраза - паліндром!")
                break
        else:
            print("Дана фраза не є паліндромом!")
            break


string = input("Введіть фразу: ")
palindrom(string)

# 3. Нехай на кожну сходинку можна стати з попередньої або переступивши через одну.
# Визначте, скількома способами можна піднятися на задану сходинку.

def step(n):
    print(f"1-й спосіб - ступати на кожну сходинку. Потріно зробити {n} кроків")

    if n % 2 == 0:
        print(f"2-й спосіб - ступати через одну сходинку. Потрібно зробити {int(n / 2)} кроків")
    else:
        print(f"2-й спосіб - ступати через одну сходинку. Потрібно зробити {int((n - 1) / 2)} кроків та один крок на наступну")


n = int(input("Введіть кількість сходинок: "))
step(n)


# 4. Напишіть рекурсивну функцію, яка обчислює суму натуральних чисел, які входять до заданого проміжку.

def sum_chisle(n):
    if n == 0:
        # умова виходу
        return 0
    else:
        # рекурсивний виклик
        return n + sum_chisle(n-1)


n = int(input("Введіть число: "))
print(f"Сума натуральних чисел до {n} включно = {sum_chisle(n)}")


# 5. Створіть функцію quadratic_equation, яка приймає на вхід 3 параметри: a, b, c.
# Усередині цієї функції створити змінні x1, x2 зі значенням None (спочатку приймаємо, що рівняння не має коренів)
# та функцію calc_rezult з формальними параметрами зовнішньої функції quadratic_equation.
# Всередині функції calc_rezult здійснити пошук дискримінанта, згідно з результатом якого зробити розрахунок коренів
# рівняння. Зовнішня функція quadratic_equation має повернути перелік значень коренів квадратного рівняння.
# Надати можливість користувачеві ввести з клавіатури формальні параметри для передачі їх у створену функцію
# quadratic_equation, результати роботи функції відобразити на екрані.


def quadratic_equation(a, b, c):
    x1 = None
    x2 = None

    def calc_rezult(a, b, c):
        print(a, b, c)

        nonlocal x1, x2
        d = b*b - 4 * a * c
        if d > 0:
            x1 = (-b + d ** 0.5) / (2 * a)
            x2 = (-b - d ** 0.5) / (2 * a)
        if d == 0:
            x1 = x2 = -b / (2 * a)

        return x1, x2

    calc_rezult(a, b, c)

    if x1 == None:
        print("Коренів не існує")
    else:
        print(f"x1 = {x1}, x2 = {x2}")


a = int(input("Введіть а: "))
b = int(input("Введіть b: "))
c = int(input("Введіть c: "))

quadratic_equation(a, b, c)

